var chart6 = c3.generate({
    bindto: '#barGraph',
    padding: {
        top: 0,
        left: 30,
        right: 20,
    },
    data: {
        columns: [
            ['Likes', 15, 58, 62, 87, 32, 58, 55, 21, 20, 30, 98, 10, 22, 98, 99, 105, 82, 57, 121, 78],
            ['Shares', 21, 26, 30, 38, 11, 24, 36, 53, 58, 62, 65, 61, 64, 32, 45, 71, 38, 23, 65, 11],
            ['Test', 21, 26, 30, 38, 11, 24, 36, 53, 58, 62, 65, 61, 64, 32, 45, 71, 38, 23, 65, 11],
        ],
        type: 'bar',
        labels: true,
        colors: {
            Likes: '#118cf1',
            Shares: '#FF7E39',
            Test: '#FFFF00'
        },
    },
    axis: {
        x: {
            type: 'category',
            categories: ['1 янв', '2 янв', '3 янв', '4 янв', '5 янв', '6 янв', '7 янв', '8 янв', '9 янв', '10 янв', '11 янв', '12 янв', '13 янв', '14 янв', '15 янв', '16 янв', '17 янв', '18 янв', '19 янв', '20 янв'],
            tick: {
                rotate: 45
            }
        },
    },
});
